app/controllers/newsletters_controller.rb

SELECT "newsletters".* FROM "newsletters"
---
  def index
    @newsletters = Newsletter.all

DELETE FROM "newsletters" WHERE "newsletters"."id" = $1  [["id", 1]]
---
  def destroy
    @newsletter = Newsletter.find(params[:id])
    @newsletter.destroy