app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all.order(date: :desc)
---
SELECT "newsletters".* FROM "newsletters" ORDER BY "newsletters"."date" ASC, "desc" ASC

  def show
    @newsletter = Newsletter.find(params[:id])
---
SELECT  "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def create
    @newsletter = Newsletter.new
    @newsletter.date = Date.parse(newsletters_param["date"]).strftime("%B %d, %Y")
    stories = @newsletter.get_stories
    html = ''
    if stories.empty?
      html = "<h3 id='empty-table'>No stories found for this newsletter :(</h3>"
    else
      stories.reverse_each do |story|
        html += render_to_string partial: "story", locals: {story: story}
      end
    end
    @newsletter.html = html
    if @newsletter.save
      url = URI("https://lyra-api.herokuapp.com/api/newsletters")
      https = Net::HTTP.new(url.host, url.port);
      https.use_ssl = true

      request = Net::HTTP::Post.new(url)
      request["Authorization"] = "Bearer WBktXBdQAGL717bfLaUMbRr2"
      form_data = [['date', @newsletter.date], ['html', @newsletter.html]]
      request.set_form form_data, 'multipart/form-data'
      response = https.request(request)
      @newsletter.lyraID = JSON.parse(response.body)["data"]["id"]
      @newsletter.save
      redirect_to newsletters_url
    else
      @newsletters = Newsletter.all.order(date: :desc)
---
SELECT "stories".* FROM "stories"
INSERT INTO "newsletters" ("date", "html", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "newsletters".* FROM "newsletters" ORDER BY "newsletters"."date" DESC

  def update
    @newsletter = Newsletter.find(params[:id])
    @stories = @newsletter.get_stories
    html = ''
    @stories.reverse_each do |story|
      html += render_to_string partial: "story", locals: {story: story}
    end

    @newsletter.html = html
    if @newsletter.save
---
SELECT  "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "newsletters" SET "html" = $1, "updated_at" = $2 WHERE "newsletters"."id" = $3

  def destroy
    @newsletter = Newsletter.find(params[:id])
    url = URI("https://lyra-api.herokuapp.com/api/newsletters/" + @newsletter.lyraID)
    https = Net::HTTP.new(url.host, url.port);
    https.use_ssl = true
    request = Net::HTTP::Delete.new(url)
    request["Authorization"] = "Bearer WBktXBdQAGL717bfLaUMbRr2"
    https.request(request)
    puts
    @newsletter.destroy
---
SELECT  "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
DELETE FROM "newsletters" WHERE "newsletters"."id" = $1  [["id", 32]]