app/controllers/stories_controller.rb

  def update
    @story = Story.find(params[:id])

    if @story.update(stories_param)
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "stories" SET "title" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["title", "This is test 4 and ghost"], ["updated_at", "2020-11-17 00:15:08.483300"], ["id", 4]]

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 3]]