app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.all

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def show
    @story = Story.find(params[:id])

INSERT INTO "stories" ("title", "body", "tag", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Pilot"], ["body", "<p>Yooooo</p>"], ["tag", "TEST"], ["created_at", "2020-11-18 22:52:12.907541"], ["updated_at", "2020-11-18 22:52:12.907541"]]
---
  def create
    @story = Story.new(stories_param)
    @story.tag.upcase!
    if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
  def edit
    @story = Story.find(params[:id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "stories" SET "title" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["title", "Yo mama so fat"], ["updated_at", "2020-11-18 22:29:58.354863"], ["id", 33]]
---
  def update
    @story = Story.find(params[:id])
    if @story.update(stories_param)

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 34]]
---
  def destroy
    @story = Story.find(params[:id])
    url = URI("https://lyra-api.herokuapp.com/api/stories/" + @story.lyraID)

    https = Net::HTTP.new(url.host, url.port);
    https.use_ssl = true

    request = Net::HTTP::Delete.new(url)
    request["Authorization"] = "Bearer WBktXBdQAGL717bfLaUMbRr2"

    response = https.request(request)

    @story.destroy