app/models/newsletter.rb

SELECT "stories".* FROM "stories" ORDER BY "date" ASC
---
  def get_stories
    date = self.date;
    Story.all.select { |ele| ele.created_at.strftime("%B %d, %Y") == date }